import SizeBox from "@/component/size-box";

export default function Policies_and_provisions() {

    return (
        <SizeBox className="flex flex-col !items-start m-4 p-4  " >
            <h1 className="text-4xl font-bold my-4 text-safety-700  ">سياسات و أحكام </h1>
            <div className="flex flex-col !items-start m-4 p-4 *:text-xl *:my-2 *:text-slate-900">

                <h2 className="text-2xl font-bold my-4">مقدمة</h2>
                <p> يرجى قراءة هذه السياسة (سياسة و أحكام) إلى جانب سياسة الخصوصية وكافة السياسات بشكل جيد للتأكد من فهمك لكل البنود قبل استخدام إحدى مواقع إنسبكتكس أو تطبيقاته فمن خلال الوصول إلى أو استخدام أي جزء من المواقع أو التطبيقات أو تقديم طلب، فأنت توافق على الالتزام بهذه السياسات والأحكام  وأي تعديلات قد تقام عليها.</p>
                <p>            إذا كنت لا توافق على جميع هذه الشروط، يرجى عدم إستخدام اي من مواقعنا أو تطبيقاتنا.            </p>
                <h2 className="text-2xl font-bold my-4"> التعريفات</h2>

                <p> في هذه السياسات, و في جميع أركان المواقع الخاصة بإنسبكتكس و التطبيقات الخاصة بإنسبكتكس, تحمل المصطلحات التالية المعاني  المشار إليها :</p>
                <p>  منصة، نحن، ضمير المتكلم أو ضمير الملكية: تشير إلى مواقع وتطبيقات و الخدمات التابعة لإنسبكتكس</p>
                <p> الحساب: يشير إلى حساب المستخدم في مواقع أولتطبيقات إنسبكتكس والذي يمكنه من الانتفاع بأي من الخدمات, أو الاستشارات, أو المعلومات</p>
                <p> المستخدم: يشير إلى أي شخص يقوم بإنشاء حساب على مواقع او تطبيقات إنسبكتكس أو يستخدم الخدمات</p>
                <p> الخدمات: يشير إلى الخدمات التي توفرها مواقعنا الاكترونية والتطبيقات على متاجر جوجل بلاي وابل ستور</p>
                <p> الطلب: يشير إلى طلب خدمة من خلال مواقعنا الالكترونية أو تطبيقاتنا</p>
                <p> المحتوى: يشير إلى جميع الصوتيات، والفيديوهات، والنصوص، والرسومات، والصور، وأي مواد أخرى يتم إدخالها، أو معالجتها، أو تضمينها، أو الدخول إليها من خلال مواقعنا الإلكترونية أو تطبيقاتنا</p>
                <p> مواد المواقع: تشير الى كافة المحتويات وجميع المواد المذكورة والتي تشمل شعار إنسبكتكس وكافة التصاميم الخاصة ب إنسبكتكس ، والنصوص والعبارات، والصور، والمعلومات، والبرامج، والملفات الصوتية، والملفات الأخرى وطريقة ترتيبها. </p>

                <h2 className="text-2xl font-bold my-4"> قيود الاستخدام</h2>


                <p>   تعود ملكية وإدارة هذا الموقع لإنسبكتكس ولا يجوز إعادة نشر،انتاج،تحميل، ترخيص, بيع,تأجير, وضع, تخصيص ،نقل أو توزيع  أو إستغلال أو إستضافة الخدمة أو أياً من مواد هذا الموقع بدون موافقة كتابية مسبقة من الشركة . إلا أنه يجوز نسخ المحتوى دون تغيير أو التعديل بهدف الاستخدام الشخصي بحاسوبك/هاتفك الخاص، أو أي أداة أخرى إذا تطلب الأمر ، شرط الاحتفاظ بحقوق النشر وجميع اشعارات الملكية الأخرى.</p>
                <p>   ويعتبر تعديل أي من المواد أو استخدامها لأغراض أخرى انتهاكاً لحقوق النشر الخاصة بإنسبكتكس.</p>
                <p>  تحتفظ إنسبكتكس بحق إلغاء أي ترخيص مستخدم، او اشتراك أي مستخدم على المواقع/التطبيقات، أو اتخاذ أي إجراء قانوني إذا كان فريق إنسبكتكس يعتقد أن هناك أي مخالفة للشروط والأحكام أو سياسة الخصوصية.</p>
                <p>   على المستخدم ان يدفع كامل التكاليف المالية المقررة من قبل المواقع او التطبيق مقابل الخدمة المطلوبة، عن طريق طرق الدفع المحددة  سواءً كان الدفع أو السداد مشترطًا قبل تقديم الخدمة المطلوبة أو بعد تقديمها</p>
                <p>   بالإضافة إلى ان طول فترة استخدامك, او تصفحك للموقع أو التطبيقات, أو فترة طلبك لأي خدمة يوفرها الموقع, لا يجوز لك:</p>
                <ul className="*:list-disc *:p-2 m-6" >
                    <li>  استخدام الموقع/التطبيق بطريقة مزعجة، سيئة، فيها نوع من التهديد أو تشويه لسمعة الآخرين، أو أي نوع من انتهاك الحقوق لأي طرف آخر (يشمل ذلك حقوق النشر وحقوق الملكية الأخرى), او إستخدامه بطريقة غير قانونية، فيها  اي شكل من اشكال اتزوير أو الاحتيال</li>
                    <li>  تقديم معلومات شخصية سرية ما لم يكن مطلوباً ذلك بشكل واضح من إنسبكتكس</li>
                    <li>  انتحال شخصية أو استخدام غير نظامي لاسمك أو هويتك أو إظهار الانتماء لأشخاص أو مجموعات أخرى</li>
                    <li>  تعديل أو ترجمة أو تكييف أو دمج أو تفكيك أو إجراء أعمال مشتقة لأي جزء من مواقع إنسبكتكس أو تطبيقاتها .</li>
                    <li> الوصول إلى الخدمة أو الموقع أو التطبيق بغاية إنشاء خدمات مشابهة أو منافسة</li>
                    <li>  استخدام تقنية أو وسائط أخرى للوصول لموقع إنسبكتكس أو المحتوى بطريقة غير مرخصة من قبل إنسبكتكس او حتى استخدام أو إطلاق لنظام آلي للوصول لموقع إنسبكتكس أو المحتوى على سبيل المثال الروبوتات، برامج اختراق سبايدر أو قراء دون اتصال بالإنترنت.</li>
                    <li> إزالة أو إتلاف أي شعارات بحقوق التأليف والنشر أو علامات الملكية الواردة في الموقع؛ أو استخدام العلامات الوصفية أو أي نص مخفي يستخدم اسمنا أو علاماتنا التجارية</li>
                    <li>  محاولات لإدخال فيروسات أو أي رمز جهاز كمبيوتر، ملفات، أو برامج قد تعطل أو تحد من الوظائف الأساسية لنظام تشغيل الجهاز، أو أجهزة أخرى أو وسائل اتصال أخرى, او محاولات غير مصرح بها للوصول لشبكة إنسبكتكس أو حسابات المستخدمين</li>
                </ul>
                <p>  محاولات لتعطيل أو إتلاف أو إضعاف لخدمات/شبكات اتصال إنسبكتكس.</p>


                <h2 className="text-2xl font-bold my-4">  من يحق له استخدام هذه المواقع </h2>

                <p>   لا يحق للأشخاص بأعمار أقل من 18 سنة استخدام أي من مواقع إنسبككس أو تطبيقاتها.</p>
                <p>   يجب أن يكون المستخدم بعمر  18 سنة وما فوق ليحق له تصفح أو استخدام هذه المواقع.</p>
                <p>    لطلب بعض الخدمات المحددة على موقعنا أو التطبيقات,، يجب أن تقوم بتسجيل بياناتك للحصول على حساب خاص بك لدينا. عند تسجيلك لدينا فإنك توافق على انك تقوم بإنشاء حساب واحد فقط، و تقدم معلومات دقيقة، وصحيحة، كاملة ومحدثة, بما في ذلك اسم المستخدم، كلمة المرور، العنوان، البريد الإلكتروني، رقم الهاتف، معلومات الدفع (مثل رقم بطاقة المصرف الائتمانية), تستخدام التطبيق من خلال جهاز إلكتروني آمن مع إغلاق التطبيقات المتصلة بالإنترنت غير المستخدمة، والتأكد من أن برنامج الحماية من الفيروسات محدث على الدوام و انك تحفاظ على معلومات حسابك وتحديثها باستمرار و على أمان حسابك من خلال عدم مشاركة كلمة المرور الخاصة بك مع الآخرين عدم إعطاء أي معلومة سرية عبر الهاتف أو شبكة الانترنت مالم تعرف هوية الشخص أو الطرف المستقبل للمعلومة</p>
                <p>    عدم مشاركة معلومات الدخول (اسم المستخدم وكلمة المرور) مع الآخرين، وعدم السماح للآخرين باستخدام حساب المستخدم في التطبيق. وعدم السماح للآخرين باستخدام جهاز الكمبيوتر الخاص بك للدخول إلى حسابك و  في حال الاشتباه بأي حالة اختراق لحسابك عبر هذه المواقع يجب إبلاغ إنسبكتكس على الفور بالإضافة الى تحمّلك مسؤولية كافة الأنشطة التي تقوم بها على حسابك وتتحمل المسؤولية تجاه أي مخاطر يتعرض لها حسابك بسبب أي استخدام غير مصرح به.</p>
                <p>    في حالات تشكيك المستخدم بأن شخصاَ آخر استطاع الحصول على معلومات الدخول إلى حسابه في التطبيق أو أي معلومة سرية أخرى, فعليه الاتصال الفوري بالدعم الفني للتطبيق.</p>



                <h2 className="text-2xl font-bold my-4"> إخلاء المسؤولية بشأن بنود محددة </h2>


                <p>   ما تقدمه مواقع أو تطبيقات إنسبكتكس الإلكترونية من  خدمات ومعلومات ومواد ووظائف، يتم توفيرها لاستخدامكم الشخصي كما هي و كما هي متاحة و يعتبر إستخدامك لها إقرار منك بأن استخدامك لهذه الخدمة سيكون على مسؤوليتك وحدك, و انك تخلي إنسبكتكس مديريها أو موظفيها أو تابعيها أو وكلائها أو متعهديها أو متدربيها أو مزودي خدماتها أو مانحي التراخيص لها عن جميع الضمانات، الصريحة أو الضمنية، فيما يتعلق بالخدمة.</p>
                <p>   لا تتحمل إنسبكتكس, مسؤولية  أي تأخير أو عدم إنجاز لطلبك في موقع أو تطبيق إنسبكتكس الذي قد ينشأ عن أسباب خارجة عن سيطرتنا أو سيطرة مزودي الخدمة.</p>
                <p>   كما لا تتحمل الشركة حدوث أي حادثة خارجة عن سيطرتنا أو عن سيطرة مزودي خدمات البنية التحتية، بحيث إن ذلك يمنعنا من مواصلة تقديم الخدمة من خلال مواقعنا الإلكترونية أو التطبيق, و لا تقدم إنسبكتكس أي ضمانات سواء كانت صريحة أو ضمنية إلى أقصى حد مسموح به ووفق القانون المعمول به، وتشمل الضمانات أن تكون هذه المواقع قابلة للتسويق، موثوقة، متوفرة، تحوي معلومات دقيقة، ومناسبة لغرض معين أو ضرورة محددة، غير مخالفة، خالية من العيوب أو الفيروسات، قابلة للعمل دون انقطاع وأن استخدام هذه المواقع من قبل المستخدم يتوافق مع القوانين المعمول بها والمطبقة على المستخدم، أو أن معلومات المستخدم المتعلقة بهذه المواقع، يتم نقلها أو استلامها بطريقة ناجحة ودقيقة وآمنة بشكل مثالي حيث أن المواد والمعلومات الموجودة على هذه المواقع قد تتضمن بعض الأخطاء الفنية أو المطبعية ولا تتعهد إنسبكتكس أو تقر أو تضمن أن المحتوى المنشور على هذه الخدمة أو عبرها يتوافق مع المعايير الاجتماعية والثقافية والأخلاقية المقبولة، كما لا تضمن إنسبكتكس أن مواد المستخدم المنشورة على أو عبر هذه الخدمة لا تنتهك حقوق أي طرف ثالث. ولا يمكننا أن نضمن أو أن نتحمل المسؤولية عن أي انقطاعات أو أخطاء أو تجاوزات قد تنشأ عن استخدام هذه البوابة أو محتوياتها أو أي موقع يرتبط بها -سواء كان ذلك بعلمنا أو بدونه، وليس للمستخدم أي حق في ملكية أو ضمان سرية أي نوع من الاتصالات أو المعلومات التي قام بإرسالها من خلال هذه البوابة,</p>
                <p>   ويجوز لإنسبكتكس إنهاء أو تغيير أو تعليق أو إيقاف أي جانب من جوانب هذه الخدمة، بما في ذلك إتاحة أي ميزات للخدمة، في أي وقت دون إشعار مسبق ودون أدنى مسؤولية, كما يجوز لإنسبكتكس، تصحيح أي أخطاء في أي جزء من الخدمة وإجراء تغييرات على الخدمة والمواد أو المنتجات أو البرامج أو الخدمات أو الأسعار الموضحة في الخدمة في أي وقت ودون إشعار مسبق</p>

                <h2 className="text-2xl font-bold my-4">   التعديل على هذه المواقع</h2>



                <p>  يحق لإنسبكتكس التعديل، أو إيقاف المواقع و التطبيقات بشكل مؤقت أو دائم، وتعديل أي من خصائصها, أسعارها, أو أقسام من المواقع او التطبيقات دون إشعار مسبق. وأنت توافق على جميع هذه التغييرات التي ممكن ان تحصل وأن إنسبكتكس لا تتحمل أي مسؤولية تجاه أي تعديل أو إيقاف للمواقع أو التطبيقات أو أي قسم منها.</p>
                <p>  كما يحق لإنسبكتكس تغيير أو تعديل هذه الشروط والأحكام أو سياسة الخصوصية أو أياً من سياسات إنسبكتكس المتعلقة باستخدام هذه المواقع أو التطبيقات في أي وقت من خلال نشر هذه التعديلات على المواقع. عند استمرار استخدامك لهذه المواقع بعد التغيير أو التعديل على الشروط والأحكام أو سياسة الخصوصية, أو السياسات الأخرى فإنك توافق على هذه التغييرات والتعديلات</p>


                <h2 className="text-2xl font-bold my-4"> حقوق النشر، العلامات المسجلة، وتراخيص المستخدم </h2>




                <p>  إن حقوق النشر, الأسماء و والنصوص والعبارات و الصور والشعارات و الباركود ، والمعلومات، والبرامج، و الملفات الصوتية المحددة لهوية إنسبكتكس أو أي من الشركات المرتبطة بها أو الأطراف الثالثة ومنتجاتها وخدماتها وكافة حقوق الملكية الفكرية الأخرى في كافة المواد والمحتوى الذي يتم توفيره كجزء من موقع إنسبكتكس, هي ملك لنا أو مانحي الرخصة في كافة الأوقات, ولا يجوز تفسير أي محتوى وارد في هذه الوثيقة على أنه يمنح أي ترخيص أو حق باستخدام أي حقوق نشر أو علامة تجارية أو حقوق ملكية فكرية أخرى لمواقع أو تطبيقات إنسبكتكس. يجوز لك استخدام هذه المادة أو المحتوى فقط على النحو المصرّح به خطّيا من قبلنا أو من قبل مانحي الرخصة.</p>
                <p>  بالدخول إلى الخدمة، فإنك تُقر بأنك تفعل ذلك لاستخدامك الشخصي غير التجاري فقط ولن تعمل على، ولن تقوم بمساعدة أو تسهيل عمل الغير على، نسخ المادة أو المحتوى، أو إعادة إنتاجه، أو بثه، أو توزيعه، أو تكييفه، أو استخدامه على نحو تجاري، أو إيجاد أعمال مبنية عليها.</p>
                <p>  ولا يجوز لك التفويض أو التشجيع أو السماح أو المساعدة في أي نسخ غير مصرّح به أو التنقيب في النصوص أو البيانات أو تجريف المواقع أو التطبيقات التابعة لإنسبكتكس ، بما في ذلك, أي برنامج عنكبوت  أو بوت أو أي تقنية أو آلية أو عملية تلقائية أخرى من أجل الوصول إلى أو نسخ أو عرض أو تسجيل أي جزء من الخدمة أو أي معلومات أو محتويات أو مواد مستخدم يتم الوصول إليها عبر الخدمة؛ أو أي تقنية أو آلية أو عملية تلقائية من أجل تحليل أي جزء من الخدمة أو أي معلومات أو محتويات أو مواد مستخدم يتم الوصول إليها عبر الخدمة لغرض تحديد الاتجاهات أو العلاقات المتبادلة أو الأنماط.</p>
                <p>  بالاضافة إلى انك بإستخدامك مواقع او تطبيقات إنسبكتكس, تفيد على انك إذا علمت بوجود توزيع أو استغلال تجاري من أي نوع، فأنت توافق على إعلامنا بذلك مباشرة.</p>
                <p>  تدير هذه الشروط والأحكام وترخيص المستخدم كافة التحديثات أو عمليات الاستبدال لمعلومات المواقع.</p>

                <h2 className="text-2xl font-bold my-4"> تكاليف الخدمات و طرق الدفع</h2>


                <p>   يتم إعلام المستخدم بقيمة الخدمة التقديرية او الفعلية قبل طلبها و بالموافقة على المبلغ, يصبح المستخدم ملزما بسداد المبلغ و الذي يُقسم لمرحلتين(قبل عملية الفحص و بعدها).   و لسداد المبلغ المتفق عليه, يمكن للمستخدم اختيار اي من وسائل الدفع التي تقبل بها مواقعنا او تطبيقاتنا  (Visa card, master card, American Express, apple pay, التحويل البنكي</p>
                <p>   في حال رفض او تعثر المستخدم من دفع قيمة الخدمة المطلوبة(الدفعة الاولى), فلا يتم تسجيل طلبه, اما في حال رفض أو تعثر المستخدم من دفع قيمة الفحص المتبقية (الدفعة الثانية), فلا يحصل المستخدم على تقرير الفحص, أو أي معلومات توصل لها الفريق أثناء عملية الفحص كما تمتنع إنسبكتكس من إعادة مبلغ الدفعة الأولى.</p>
                <p> يحق لإنسبكتكس التعديل على أسعار و تكاليف الخدمات التي تقدمها, دون اي ابلاغ, أو تحذير, أو موافقة المستخدم.</p>


                <h2 className="text-2xl font-bold my-4">الإلغاء </h2>


                ندرك  أنه في بعض الأحيان قد تغير رأيك بخصوص طلبك لأحدى الخدمات، فإذا غيرت رأيك قبل المباشرة بإجراء عملية الفحص، ما عليك سوى الاتصال بخدمة العملاء على الرقم (...) لإلغاء طلبك، و ذلك قبل يومين على الاٌقل قبل تنفيذ الخدمة, وسنبذل قصارى جهدنا في حدود المعقول لإلغائه شرط ألا يكون قد تم تنفيذ طلبك بالفعل أو بلّغت في موعد اقل من يومين من تاريخ تنفيذ الخدمة..
                وفي حال حدوث ذلك، سوف نتعامل مع الإلغاء باعتباره إرجاعاً, وفي جميع الأحوال يمكنك دائماً الاتصال بخدمة العملاء لدينا، لمساعدتك.
                <h2 className="text-2xl font-bold my-4">   التعهدات و الضانات</h2>



                <p>    يتعهد مستخدم موقع/تطبيق إنسبكتكس ويضمن بأدخاله في الموقع جميع البيانات والمعلومات الصحيحة والكاملة وغير المزورة. كما يتعهد باستخدام بطاقات إئتمانية صحيحة وصالحة وتقع تحت مسؤليته  القانونية.</p>
                <p>    يتعهد مستخدم موقع إنسبكتكس بالتعويض عن أية خسائر أو أضرار تنشأ عن عدم التزامه بهذه الشروط والأحكام أو سياسة الخصوصية  أو انتهاكه لأي من التعهدات والضمانات الواردة بهذه الشروط والأحكام، وأن يتحمل تكاليف ومصاريف الدعاوى القضائية المباشرة والغير مباشرة مهما كانت</p>

                <h2 className="text-2xl font-bold my-4">  الدعاية و الإعلان </h2>


                <p>   انتسابك لموقع إنسبكتكس يخولك أتوماتيكيا لاستقبال رسائل دعائية ونشرات بريدية من موقع إنسبكتكس أو من تطبيقاته، إن هذه الرسائل يتم إرسالها لتعريفك أو تنبيهك على جميع المعلومات التي تتعلق بخدماتنا او المعلومات الخاصة بالخدمة التي قمت بإختيارها, أو معلومات عن تحديثات او تطورات أو أي معلومات أخرى قد تتعلق بنا.</p>

            </div>

        </SizeBox>
    )
}