import SizeBox from "@/component/size-box";

export default function Privacy_policy_inspectex() {

    return (
        <SizeBox className="flex flex-col !items-start m-4 p-4  " >
            <h1 className="text-3xl font-bold my-4"> </h1>

            <h1 className="text-4xl font-bold my-4 text-safety-700  ">صفحة سياسة الخصوصية </h1>
            <div className="flex flex-col !items-start m-4 p-4 *:text-xl *:my-2">
                <p > في تطبيق (  Inspectex )، ندرك أن خصوصية معلوماتك الشخصية هامة لك ولنا. </p>
                <p> فيما يلي معلومات حول أنواع المعلومات الشخصية التي نتلقاها ونقوم بجمعها عند زيارات ( Inspectex )، وكيف نقوم بحماية معلوماتك الشخصية . </p>
                <h2 className="text-2xl font-bold my-4">ملفات السجل</h2>

                <p >كما هو الحال مع معظم مواقع الويب المختلفة، نقوم بجمع واستخدام البيانات الموجودة في ملفات السجل.</p>
                <p >تشمل المعلومات الموجودة في ملفات السجل عنوان بروتوكول الإنترنت&nbsp;(IP)&nbsp;الخاص بك، ومزود خدمة الإنترنت&nbsp;(ISP)، والمتصفح الذي استخدمته لزيارة تطبيقنا، والوقت الذي قمت فيه بالزيارة، والصفحات التي قمت بزيارتها عبر تطبيقنا.</p>

                <h2 className="text-2xl font-bold my-4">ملفات تعريف الارتباط</h2>


                <p className="flex flex-row" >نحن نستخدم ملفات تعريف الارتباط لنمنحك أفضل تجربة أستخدام ممكنة على تطبيق بسيط، لمزيد من المعلومات حول ملفات تعريف الارتباط ، تفضل بزيارة &nbsp;
                    <a className=" text-prussian-600" href="https://allaboutcookies.org/" target="_blank">allaboutcookies.org</a>.
                </p>

                <h2 className="text-2xl font-bold my-4">ملفات تعريف الارتباط الأساسية</h2>

                <p >تعد ملفات تعريف الارتباط الأساسية ضرورية لك للتنقل والتنقل في جميع أنحاء التطبيق، ولا تخزن أي معلومات يمكن استخدامها لأغراض الدعاية، بدون ملفات تعريف الارتباط الأساسية، لن يعمل تطبيقنا بشكل صحيح.</p>

                <h2 className="text-2xl font-bold my-4">ملفات تعريف الارتباط المخصصة </h2>

                <p >تخزن ملفات تعريف الارتباط هذه المعلومات ، مثل تفضيلاتك الشخصية ، وتستخدمها لتخصيص تجربة فريدة لك.</p>
                <p >قد يشمل ذلك عرض نافذة منبثقة مرة واحدة فقط في زيارتك ، أو حفظ تفضيلات اللغة الخاصة بك ، أو السماح لك بتسجيل الدخول تلقائيًا إلى بعض ميزاتنا.</p>

                <h2 className="text-2xl font-bold my-4"> ملفات تعريف الارتباط في &nbsp;Analytics</h2>

                <p >تلتقط ملفات تعريف الارتباط من&nbsp;Analytics&nbsp;بيانات مجهولة المصدر حتى نتمكن من رؤية الاتجاهات وتحسين تجربة تطبيقنا على الويب.</p>
                <p >هذه تتيح لنا اختبار تصميمات مختلفة ، وتساعدنا على تحديد الكسر إذا كان جزء من تطبيقنا لا يعمل.</p>

                <h2 className="text-2xl font-bold my-4"> ملفات تعريف الارتباط للإعلانات</h2>

                <p >قد يستخدم بعض المعلنين من الجهات الخارجية ملفات تعريف الارتباط أو إشارات الويب عند الإعلان على تطبيقنا.</p>
                <p >سيقوم هؤلاء بإرسال معلومات إلى هؤلاء المعلنين&nbsp;(مثل&nbsp;Google&nbsp;من خلال برنامج&nbsp;Google AdSense)&nbsp;بما في ذلك عنوان&nbsp;IP&nbsp;الخاص بك ، ومزود خدمة الإنترنت ، والمتصفح الذي استخدمته لزيارة تطبيقنا ، وفي بعض الحالات معلومات حول ما إذا كنت قد قمت بتثبيت&nbsp;Flash.</p>
                <ul className="mb-0">
                    <li >يستخدم موردو الجهات الخارجية، بمن فيهم&nbsp;Google، ملفات تعريف ارتباط لعرض الإعلانات بناءً على زيارات المستخدم السابقة لتطبيقنا الإلكتروني أو لمواقع أخرى على الويب.</li>
                    <li >ستتمكّن&nbsp;Google&nbsp;وشركاؤها، باستخدام ملفات تعريف الارتباط للإعلانات، من عرض الإعلانات للمستخدمين لديك استنادًا إلى زياراتهم لتطبيقنا و/أو مواقع أخرى عبر الإنترنت.</li>
                    <li >
                        <p> للمستخدمين تعطيل استخدام الإعلانات المخصصة عن طريق الانتقال إلى&nbsp;يمكن</p>
                        <a className=" text-prussian-600" href="https://www.google.ae/settings/ads" target="_blank"> إعدادات الإعلانات </a>
                    </li>
                </ul>
                <p className="flex flex-wrap mt-4" >
                    <p>إذا لم يتم اختيار&nbsp;</p>

                    <a className=" text-prussian-600" href="https://support.google.com/dfp_premium/answer/94152" target="_blank"> تعطيل عرض إعلانات الأطراف الثالثة</a>
                    ، فقد يتم استخدام ملفات تعريف ارتباط&nbsp;
                    <a className=" text-prussian-600" href="https://support.google.com/dfp_premium/answer/94149" target="_blank"> موردي أو شبكات إعلانات الأطراف الثالثة</a>
                    &nbsp;الأخرى أيضًا لعرض الإعلانات في تطبيقنا.
                </p>
                <p className="flex flex-row mt-4" >يستخدم هذا بشكل عام لأغراض الاستهداف الجغرافي على سبيل المثال&nbsp;(عرض الإعلانات&nbsp;SEO&nbsp;في&nbsp;اي دولة&nbsp;لشخص ما)&nbsp;أو عرض إعلانات معينة بناءً على مواقع محددة تمت زيارتها (مثل عرض إعلانات العقارات لشخص يرتاد مواقع العقارات).</p>
                <p className="flex flex-row mt-4" >من خلال الاستمرار في استخدام تطبيقنا ، فإنك توافق على وضع ملفات تعريف الارتباط على جهازك، يمكنك اختيار تعطيل أو إيقاف تشغيل ملفات تعريف الارتباط أو ملفات تعريف ارتباط الطرف الثالث بشكل انتقائي في إعدادات المتصفح الخاص بك. ومع ذلك ، يمكن أن يؤثر هذا على كيفية تفاعلك مع تطبيقنا وكذلك مع مواقع الويب الأخرى.</p>
                <p className="flex flex-row mt-4"  >اذا كان لديك اى سؤال او كان هنا اى مشكلة فى سياسة أستخدام البيانات الخاصة بنا الرجاء المراسلة ع من خلال صفحة الأتصال بنا.</p>

            </div>
        </SizeBox>
    )
}